Revit 2027 API
RebarConstraint.GetDistanceToCustomTarget Method
 Gets the distance from the RebarConstrainedHandle to the custom target.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetDistanceToCustomTarget()
Public Function GetDistanceToCustomTarget As Double
public:
double GetDistanceToCustomTarget()
member GetDistanceToCustomTarget : unit -> float
Return Value
Double
 Returns the distance from the RebarConstrainedHandle to the custom target.
Exceptions
Exception | Condition
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraintType of the RebarConstraint must be 'ToCustomTarget'.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace